<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"001c09e6d61be659d341b36dc898b5726ccaf0fb3da6ce412a60a6e2c599d924","plan_job_ref":"Job Write Terraform Plan to Pull Request #50 at https://github.com/hackforla/devops-security/actions/runs/9752822207","plan_out_hash":"1f7c57b78286589ca8b1308a75b640b427a86c5655d0a47af2eceed1af67daca","plan_hash":"a65ddc2da3648fb806ac51f54e545056ae1f55b6c7ebb5f59d1ff0b13e960a5c","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan in __terraform__
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.iam_user_alexe.aws_iam_user.user will be created
+   resource "aws_iam_user" "user" {
+       arn           = (known after apply)
+       force_destroy = false
+       id            = (known after apply)
+       name          = "alexe"
+       path          = "/"
+       tags          = {
+           "Access Level" = "1"
+           "Project"      = "devops-security"
        }
+       tags_all      = {
+           "Access Level" = "1"
+           "Project"      = "devops-security"
        }
+       unique_id     = (known after apply)
    }

  # module.iam_user_alexe.aws_iam_user_group_membership.user_group_membership will be created
+   resource "aws_iam_user_group_membership" "user_group_membership" {
+       groups = [
+           "read-only-group",
        ]
+       id     = (known after apply)
+       user   = "alexe"
    }

  # module.iam_user_alexe.aws_iam_user_login_profile.user_login will be created
+   resource "aws_iam_user_login_profile" "user_login" {
+       encrypted_password      = (known after apply)
+       id                      = (known after apply)
+       key_fingerprint         = (known after apply)
+       password                = (known after apply)
+       password_length         = 20
+       password_reset_required = true
+       user                    = "alexe"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Write Terraform Plan to Pull Request #50](https://github.com/hackforla/devops-security/actions/runs/9752822207)